src/test/suite/reference/request_envelope.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xop="http://www.w3.org/2004/08/xop/include"
    xmlns:xmime5="http://www.w3.org/2005/05/xmlmime"
    xmlns:osc-data="http://oracc.org/wsdl/ows.xsd"
    xmlns:osc-meth="http://oracc.org/wsdl/ows.wsdl">
    <SOAP-ENV:Body>
        <osc-meth:Request>
            <osc-data:keys>
                <osc-data:key>atf</osc-data:key>
                <osc-data:key>tests/mini</osc-data:key>
                <osc-data:key>00atf/hyphens.atf</osc-data:key>
            </osc-data:keys>
            <osc-data:data>
                <osc-data:item xmime5:contentType="*/*">
                    <xop:Include href="cid:request_zip"/>
                </osc-data:item>
            </osc-data:data>
        </osc-meth:Request>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
