src/test/suite/reference/initial_request_belsunu

--uafdHS3v
Content-Type: application/xop+xml; charset="utf-8"; type="application/soap+xml"
Content-Transfer-Encoding: binary
MIME-Version: 1.0
Content-ID: <SOAP-ENV:Envelope>

<?xml version="1.0" encoding="UTF-8"?>
               <SOAP-ENV:Envelope
                   xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
                   xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                   xmlns:xop="http://www.w3.org/2004/08/xop/include"
                   xmlns:xmime5="http://www.w3.org/2005/05/xmlmime"
                   xmlns:osc-data="http://oracc.org/wsdl/ows.xsd"
                   xmlns:osc-meth="http://oracc.org/wsdl/ows.wsdl">
                   <SOAP-ENV:Body>
                       <osc-meth:Request>
                            <osc-data:keys>
                                <osc-data:key>atf</osc-data:key>
                                <osc-data:key>cams/gkab</osc-data:key>
                                <osc-data:key>00atf/belsunu.atf</osc-data:key>
                            </osc-data:keys>
                            <osc-data:data>
                    <osc-data:item xmime5:contentType="*/*">
                        <xop:Include href="cid:request_zip"/>
                    </osc-data:item>
                </osc-data:data>
                       </osc-meth:Request>
                   </SOAP-ENV:Body>
               </SOAP-ENV:Envelope>
--uafdHS3v
Content-Type: */*
Content-Transfer-Encoding: binary
MIME-Version: 1.0
Content-ID: <request_zip>

<zip contents>
--uafdHS3v--